hugo/public/lua/fengari/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>fengari の使い方 (Lua を Web ブラウザで動かす方法) - 公開技術情報</title>
<meta name="generator" content="Hugo 0.100.1" />
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/lua/fengari/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="fengari の使い方 (Lua を Web ブラウザで動かす方法)" />
<meta property="og:description" content="Lua を Web ブラウザで動かす技術がいくつかある。 最初期のモノは lua.vm.js だろうか？ ただ lua.vm.js は開発が停止してから 4 年経過しており、今から使うには躊躇する。 そこ" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/lua/fengari/" /><meta property="article:section" content="Lua" />

<meta property="og:site_name" content="公開技術情報" />

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="fengari の使い方 (Lua を Web ブラウザで動かす方法)"/>
<meta name="twitter:description" content="Lua を Web ブラウザで動かす技術がいくつかある。 最初期のモノは lua.vm.js だろうか？ ただ lua.vm.js は開発が停止してから 4 年経過しており、今から使うには躊躇する。 そこ"/>
<meta itemprop="name" content="fengari の使い方 (Lua を Web ブラウザで動かす方法)">
<meta itemprop="description" content="Lua を Web ブラウザで動かす技術がいくつかある。 最初期のモノは lua.vm.js だろうか？ ただ lua.vm.js は開発が停止してから 4 年経過しており、今から使うには躊躇する。 そこ">

<meta itemprop="wordCount" content="2066">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/contents/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>fengari の使い方 (Lua を Web ブラウザで動かす方法)</h1>

<p>
Lua を Web ブラウザで動かす技術がいくつかある。
最初期のモノは <a href="http://daurnimator.github.io/lua.vm.js/lua.vm.js.html ">lua.vm.js</a> だろうか？</p>
<p>
ただ lua.vm.js は開発が停止してから 4 年経過しており、今から使うには躊躇する。</p>
<p>
そこで、今回は fengari の使用方法について書くことにする。</p>
<p>
&lt;<a href="https://github.com/fengari-lua/fengari">https://github.com/fengari-lua/fengari</a>&gt;</p>
<p>
なお、lua.vm.js の issue にも、次のように fengari の使用を推奨するコメントがある。</p>
<pre class="example">
Please consider using the successor to lua.vm.js, fengari
</pre>
<p>
&lt;<a href="https://github.com/daurnimator/lua.vm.js/issues/66">https://github.com/daurnimator/lua.vm.js/issues/66</a>&gt;</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
fengari とは
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
fengari は、 Lua VM を JavaScript で書いているプロジェクトだ。</p>
<p>
emscripten を使うことで、
オリジナルの Lua VM をほぼそのまま WebAssembly に変換可能だが、
fengari は WebAssembly ではなく JavaScript でポーティングしている。</p>
<p>
実行パフォーマンスは、WebAssembly の方が有利だろう。</p>
<p>
今回あえて fengari を取り上げるのは、次の理由からだ。</p>
<ul>
<li>私自身に emscripten の知識が無いため、
JS だけで完結する fengari の方が emscripten よりもハードルが低かった</li>
<li>今回やろうとしていることに、それほど実行パフォーマンスは必要ではなかった</li>
<li>
<p>自分の環境の glibc のバージョンが古くて emscripten をインストールできなかった</p>
<ul>
<li>docker を使ってまで emscripten をやるモチベーションがなかった</li>
</ul>
</li>
</ul>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
fengari の github
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
fengari は、次の URL で開発されている。</p>
<p>
&lt;<a href="https://github.com/fengari-lua/fengari">https://github.com/fengari-lua/fengari</a>&gt;</p>
<p>
一方で、Web ブラウザで fengari を動かす場合は、次の fengari-web を使用する。</p>
<p>
&lt;<a href="https://github.com/fengari-lua/fengari-web">https://github.com/fengari-lua/fengari-web</a>&gt;</p>
<p>
さらに、 fengari の Lua VM と JavaScript とを連携するため IF を提供する
fengari-interop がある。</p>
<p>
&lt;<a href="https://github.com/fengari-lua/fengari-interop">https://github.com/fengari-lua/fengari-interop</a>&gt;</p>
<p>
なお fengari-web のライブラリは、 fengari と fengari-interop を含んでいる。</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
fengari-web の使用方法
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
fengari-web を使用するには、
次の URL から fengari-web.js を落し、</p>
<p>
&lt;<a href="https://github.com/fengari-lua/fengari-web/releases">https://github.com/fengari-lua/fengari-web/releases</a>&gt;</p>
<p>
次のように HTML に組込む。</p>
<div class="src src-html">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-html" data-lang="html"><span class="line"><span class="cl"><span class="p">&lt;</span><span class="nt">script</span> <span class="na">src</span><span class="o">=</span><span class="s">&#34;fengari-web.js&#34;</span> <span class="na">type</span><span class="o">=</span><span class="s">&#34;text/javascript&#34;</span><span class="p">&gt;&lt;/</span><span class="nt">script</span><span class="p">&gt;</span></span></span></code></pre></div>
</div>
<p>
これによって、 JavaScript から fengari のシンボルを通して
Lua VM IF にアクセスできるようになる。</p>
<p>
もっともシンプルに fengari を使うには、次の通り fengari.load() を利用する。</p>
<div class="src src-js">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-js" data-lang="js"><span class="line"><span class="cl"><span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">fengari</span><span class="p">.</span><span class="nx">load</span><span class="p">(</span><span class="s1">&#39;return 1+1&#39;</span><span class="p">)())</span></span></span></code></pre></div>
</div>
<p>
fengari.load() は、ロードした Lua スクリプトを実行する関数を返すので、
スクリプトを動かすには <code class="verbatim">fengari.load()()</code> となる。</p>
<p>
ただし、この方法だと Lua を Web ブラウザ上で動かそうという物好きがやりそうな
Lua の細かい制御を実現出来ない可能性が高い。</p>
<p>
そのような細かい制御は、 fengari が提供する Lua VM IF を使用する必要がある。</p>
<p>
Lua VM IF は、 fengari が独自に提供しているものではなく、
Lua VM が元々提供しているものである。
fengari Lua VM IF は、オリジナルの Lua VM IF をポーティングしたもので、
その仕様もオリジナルのものを引き継いでいる。</p>
<p>
fengari の Lua VM IF を使用したサンプルを次に示す。</p>
<div class="src src-js">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-js" data-lang="js"><span class="line"><span class="cl">    <span class="kd">var</span> <span class="nx">lua_state</span> <span class="o">=</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">lauxlib</span><span class="p">.</span><span class="nx">luaL_newstate</span><span class="p">();</span>
</span></span><span class="line"><span class="cl">    <span class="nx">fengari</span><span class="p">.</span><span class="nx">lualib</span><span class="p">.</span><span class="nx">luaL_openlibs</span><span class="p">(</span> <span class="nx">lua_state</span> <span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="nx">fengari</span><span class="p">.</span><span class="nx">lauxlib</span><span class="p">.</span><span class="nx">luaL_requiref</span><span class="p">(</span> <span class="nx">lua_state</span><span class="p">,</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">to_luastring</span><span class="p">(</span><span class="s2">&#34;js&#34;</span><span class="p">),</span>
</span></span><span class="line"><span class="cl">                                   <span class="nx">fengari</span><span class="p">.</span><span class="nx">interop</span><span class="p">.</span><span class="nx">luaopen_js</span><span class="p">,</span> <span class="mi">1</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">    <span class="nx">fengari</span><span class="p">.</span><span class="nx">lua</span><span class="p">.</span><span class="nx">lua_pop</span><span class="p">(</span> <span class="nx">lua_state</span><span class="p">,</span> <span class="mi">1</span><span class="p">);</span> <span class="cm">/* remove lib */</span></span></span></code></pre></div>
</div>
<p>
Lua を C に組み込んだ経験を持つ人なら、ぱっと見ただけでだいたい検討が付くだろう。
fengari.lauxlib などのシンボルを除けば、 Lua VM IF そのものだ。</p>
<p>
つまり、 JavaScript 上で Lua VM IF を書くことで、 Lua コードを Web 上で制御できる。</p>
<p>
Lua VM IF の詳細については、
fengari ではなく Lua のリファレンスを確認する必要がある。</p>
<p>
&lt;<a href="http://milkpot.sakura.ne.jp/lua/lua53_manual_ja.html#4">http://milkpot.sakura.ne.jp/lua/lua53_manual_ja.html#4</a>&gt;</p>
<p>
Lua VM IF を見慣れている人なら気付いたかもしれないが、
上記の fengari Lua VM IF のサンプルには、
通常の Lua VM IF の初期化コードにはない処理を行なっているのが分かると思う。</p>
<div class="src src-js">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-js" data-lang="js"><span class="line"><span class="cl">    <span class="nx">fengari</span><span class="p">.</span><span class="nx">lauxlib</span><span class="p">.</span><span class="nx">luaL_requiref</span><span class="p">(</span> <span class="nx">lua_state</span><span class="p">,</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">to_luastring</span><span class="p">(</span><span class="s2">&#34;js&#34;</span><span class="p">),</span>
</span></span><span class="line"><span class="cl">                                   <span class="nx">fengari</span><span class="p">.</span><span class="nx">interop</span><span class="p">.</span><span class="nx">luaopen_js</span><span class="p">,</span> <span class="mi">1</span><span class="p">);</span></span></span></code></pre></div>
</div>
<p>
これが何をやっているのかというと、
fengari-interop パッケージを Lua VM 内の js シンボルにセットしている。</p>
<p>
fengari-interop は、 Lua VM と JavaScript とを連携するため IF で、
次のようなコードを Lua で書くことで JavaScript のリソースへのアクセスを提供するものだ。</p>
<div class="src src-lua">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-lua" data-lang="lua"><span class="line"><span class="cl"><span class="n">js.global</span><span class="p">:</span><span class="n">alert</span><span class="p">(</span> <span class="s2">&#34;hoge&#34;</span> <span class="p">)</span> <span class="c1">-- javascript の alert()</span></span></span></code></pre></div>
</div>
<p>
ここで注意すべきは、
js モジュールの関数コールを <code class="verbatim">.</code> ではなく <code class="verbatim">:</code> によるメソッドコールにするということだ。</p>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
fengari-web Lua VM IF の使用上の注意
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
fengari-web Lua VM IF と JavaScript とでデータをやり取りする場合、
注意が必要なケースがある。</p>
