hugo/content/Lua/fengari.org
*** JavaScript から fengari-web Lua VM IF に文字列を渡す
   
前述の通り、fengari.load() は下記の様に使用する。

#+BEGIN_SRC js
console.log(fengari.load('return 1+1')())
#+END_SRC


この fengari.load() と似た動きをさせる fengari-web Lua VM IF を次に示す。

#+BEGIN_SRC js
var txt = fengari.to_luastring( "print( (function() return 1 + 1; end)() )" );
fengari.lauxlib.luaL_dostring( fengari.L, txt );
#+END_SRC

- fengari.lauxlib.luaL_dostring() は Lua VM IF の API で、指定のスクリプトを実行する。
  - luaL_dostring() の第一引数は Lua VM の lua_State で、
    fengari.L は fengari がデフォルトで使用する lua_State である。
  - fengari.L の代わりに fengari.lauxlib.luaL_newstate() で
    生成した lua_State を渡しても良い。
- fengari.to_luastring() は fengari 独自の API で、
  JavaScript の文字列を fengari  Lua VM IF で利用可能な文字列に変換する。
  - fengari  Lua VM IF の文字列は JavaScript の文字列とは異なり、
    Uint8Array を利用している。
- =print( (function() return 1 + 1; end)() )= は、
  1 + 1 を実行する関数を定義し、それを実行し、結果を print() で出力している。
    
このように fengari-web Lua VM IF に文字列を渡す場合、
*fengari.to_luastring() で文字列データを変換して渡す* 必要がある。

*** fengari-web Lua VM IF から文字列を取得する

Lua VM IF の lua_typename() は、指定の Lua 値のタイプに対応する文字列を返す関数である。

これを fengari-web で console.log() に出力するには、次のようになる。

#+BEGIN_SRC js
console.log( fengari.to_jsstring( fengari.lua.lua_typename( fengari.L, fengari.lua.LUA_TTABLE ) ) )
#+END_SRC

- fengari.lua.lua_typename() を実行する
  - LUA の定数の LUA_TTABLE は fengari.lua で定義される
- fengari.lua.lua_typename() は文字列を返すが、
  これは Lua VM の文字列であるため
  console.log() で出力するには JavaScript の文字列に変換する必要がある。
- fengari.to_jsstring() は、上記の目的のための文字列変換を行なっている。

このように、fengari-web Lua VM IF から文字列を取得した場合、
*fengari.to_jsstring() で文字列データを変換する* 必要がある。

