hugo/public/lua/fengari/index.html
<div id="outline-container-headline-5" class="outline-4">
<h4 id="headline-5">
JavaScript から fengari-web Lua VM IF に文字列を渡す
</h4>
<div id="outline-text-headline-5" class="outline-text-4">
<p>
前述の通り、fengari.load() は下記の様に使用する。</p>
<div class="src src-js">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-js" data-lang="js"><span class="line"><span class="cl"><span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span><span class="nx">fengari</span><span class="p">.</span><span class="nx">load</span><span class="p">(</span><span class="s1">&#39;return 1+1&#39;</span><span class="p">)())</span></span></span></code></pre></div>
</div>
<p>
この fengari.load() と似た動きをさせる fengari-web Lua VM IF を次に示す。</p>
<div class="src src-js">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-js" data-lang="js"><span class="line"><span class="cl"><span class="kd">var</span> <span class="nx">txt</span> <span class="o">=</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">to_luastring</span><span class="p">(</span> <span class="s2">&#34;print( (function() return 1 + 1; end)() )&#34;</span> <span class="p">);</span>
</span></span><span class="line"><span class="cl"><span class="nx">fengari</span><span class="p">.</span><span class="nx">lauxlib</span><span class="p">.</span><span class="nx">luaL_dostring</span><span class="p">(</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">L</span><span class="p">,</span> <span class="nx">txt</span> <span class="p">);</span></span></span></code></pre></div>
</div>
<ul>
<li>
<p>fengari.lauxlib.luaL_dostring() は Lua VM IF の API で、指定のスクリプトを実行する。</p>
<ul>
<li>luaL_dostring() の第一引数は Lua VM の lua_State で、
fengari.L は fengari がデフォルトで使用する lua_State である。</li>
<li>fengari.L の代わりに fengari.lauxlib.luaL_newstate() で
生成した lua_State を渡しても良い。</li>
</ul>
</li>
<li>
<p>fengari.to_luastring() は fengari 独自の API で、
JavaScript の文字列を fengari  Lua VM IF で利用可能な文字列に変換する。</p>
<ul>
<li>fengari  Lua VM IF の文字列は JavaScript の文字列とは異なり、
Uint8Array を利用している。</li>
</ul>
</li>
<li><code class="verbatim">print( (function() return 1 + 1; end)() )</code> は、
1 + 1 を実行する関数を定義し、それを実行し、結果を print() で出力している。</li>
</ul>
<p>このように fengari-web Lua VM IF に文字列を渡す場合、
<strong>fengari.to_luastring() で文字列データを変換して渡す</strong> 必要がある。</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-4">
<h4 id="headline-6">
fengari-web Lua VM IF から文字列を取得する
</h4>
<div id="outline-text-headline-6" class="outline-text-4">
<p>
Lua VM IF の lua_typename() は、指定の Lua 値のタイプに対応する文字列を返す関数である。</p>
<p>
これを fengari-web で console.log() に出力するには、次のようになる。</p>
<div class="src src-js">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-js" data-lang="js"><span class="line"><span class="cl"><span class="nx">console</span><span class="p">.</span><span class="nx">log</span><span class="p">(</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">to_jsstring</span><span class="p">(</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">lua</span><span class="p">.</span><span class="nx">lua_typename</span><span class="p">(</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">L</span><span class="p">,</span> <span class="nx">fengari</span><span class="p">.</span><span class="nx">lua</span><span class="p">.</span><span class="nx">LUA_TTABLE</span> <span class="p">)</span> <span class="p">)</span> <span class="p">)</span></span></span></code></pre></div>
</div>
<ul>
<li>
<p>fengari.lua.lua_typename() を実行する</p>
<ul>
<li>LUA の定数の LUA_TTABLE は fengari.lua で定義される</li>
</ul>
</li>
<li>fengari.lua.lua_typename() は文字列を返すが、
これは Lua VM の文字列であるため
console.log() で出力するには JavaScript の文字列に変換する必要がある。</li>
<li>fengari.to_jsstring() は、上記の目的のための文字列変換を行なっている。</li>
</ul>
<p>このように、fengari-web Lua VM IF から文字列を取得した場合、
<strong>fengari.to_jsstring() で文字列データを変換する</strong> 必要がある。</p>
</div>
</div>
